Revit 2027 API
Document.SaveAs(String) Method
 Saves the document to a given file path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SaveAs(
	string filepath
)
Public Sub SaveAs (
	filepath As String
)
public:
void SaveAs(
	String^ filepath
)
member SaveAs :
        filepath : string -> unit
Parameters
filepath String
 File name and path to be saved as. Either a relative or absolute path can be provided.
Exceptions
Exception | Condition
ArgumentException |  filepath is an empty string. -or- The filepath is not a valid file path.
ArgumentNullException |  A non-optional argument was null
CentralModelException |  Central model is missing. -or- Central model is incompatible. -or- The central model was saved in a different version of Revit. -or- Revit encountered errors while saving to the new central model. Resave again as a new central model. -or- Incompatible servers for external services. -or- Username does not match the one used to create the local file. -or- Revit could not save all of the worksets that have been changed. Try again.
FileAccessException |  The file at the given path location could not be accessed or saved.
FileNotFoundException |  The given file, path or network location could not be found during save.
ForbiddenForDynamicUpdateException |  SaveAs may not be called during dynamic update.
InsufficientResourcesException |  This computer does not have enough memory, disk space, or other necessary resource to save the model.
InvalidOperationException |  This Document is not a primary document, it is a linked document. -or- SaveAs is temporarily disabled. -or- There is an existing file at filepath. -or- Saving is not allowed in the current application mode. -or- The document just had worksharing enabled or was opened detached, so SaveAsOptions must be passed in SaveAs with WorksharingSaveAsOptions.SaveAsCentral set to true. -or- Operation is not permitted when there is any open sub-transaction, transaction, or transaction group. -or- Saving failed.
OperationCanceledException |  Saving was canceled by the user or by an API event callback.
OutdatedDirectlyOpenedCentralException |  Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Remarks
 The document's title in Revit's title bar will be updated automatically to reflect the file's new name.
See Also
Reference
Document Class
SaveAs Overload
Autodesk.Revit.DB Namespace